{"id":"fd3f79c1-540a-48f6-9722-9e489f40ae8f","updated_at":"2026-05-08T10:34:56.180Z","updated_by":"elastic","created_at":"2026-05-08T10:34:56.180Z","created_by":"elastic","name":"DCSync Attack Detection","tags":["MITRE T1003.006"],"interval":"5m","enabled":true,"revision":0,"description":"Detects AD replication rights access from non-DC — indicates DCSync credential dumping — MITRE T1003.006","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"b8bc4f6d-6707-4499-90ce-85d2e2566281","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"4662\" AND winlog.event_data.Properties: (*1131f6aa* OR *1131f6ab* OR *89e95b76*)","filters":[],"actions":[]}
{"id":"81e4d445-545f-480e-b5ac-c251bc9734be","updated_at":"2026-05-08T10:39:01.331Z","updated_by":"elastic","created_at":"2026-05-08T10:39:01.331Z","created_by":"elastic","name":"LSASS Access Attempt - Defender PPL Validation","tags":["MITRE T1003.001"],"interval":"5m","enabled":true,"revision":0,"description":"Detects process access targeting LSASS memory — credential dumping attempt. In this lab Defender PPL blocked execution — documented as defensive control validation — MITRE T1003.001","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"1627e8ff-02eb-4dc2-bbeb-383c5b6a83a6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"10\" AND winlog.event_data.TargetImage: *lsass.exe*","filters":[],"actions":[]}
{"id":"3b3b144a-4516-4857-a854-198311c75949","updated_at":"2026-05-08T10:42:51.466Z","updated_by":"elastic","created_at":"2026-05-08T10:42:51.466Z","created_by":"elastic","name":"Lateral Movement - NTLM Network Logon Detection","tags":["MITRE T1550.002"],"interval":"5m","enabled":true,"revision":0,"description":"Detects NTLM network logons consistent with Pass-the-Hash or SMB lateral movement from non-admin systems — MITRE T1550.002","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"db984848-96c0-42fe-a8ae-c3d718f75275","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"4624\" AND winlog.event_data.LogonType: \"3\" AND winlog.event_data.AuthenticationPackageName: \"NTLM\"","filters":[],"actions":[]}
{"id":"ff5a23bb-3afb-4de1-8373-03a9c6355d33","updated_at":"2026-05-08T10:32:18.088Z","updated_by":"elastic","created_at":"2026-05-08T10:32:18.088Z","created_by":"elastic","name":"AS-REP Roasting Detection","tags":["MITRE T1558.004"],"interval":"5m","enabled":true,"revision":0,"description":"Detects Kerberos TGT request without pre-authentication — indicates DoesNotRequirePreAuth misconfiguration — MITRE T1558.004","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"1ab13fa6-7eb0-4d7a-b72a-b7a47f3ea8ea","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"4768\" AND winlog.event_data.PreAuthType: \"0\"","filters":[],"actions":[]}
{"id":"65fdad2c-1c04-41b5-9b0c-d32b053c78a1","updated_at":"2026-05-08T10:36:38.241Z","updated_by":"elastic","created_at":"2026-05-08T10:36:38.241Z","created_by":"elastic","name":"SharpHound LDAP Reconnaissance Detection","tags":["MITRE T1087.002"],"interval":"5m","enabled":true,"revision":0,"description":"Detects high volume LDAP enumeration consistent with SharpHound/BloodHound collection — MITRE T1087.002","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"c3202d25-2105-446e-ae65-31403afd009b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"4662\" AND winlog.event_data.ObjectType: \"organizationalUnit\"","filters":[],"actions":[]}
{"id":"7a6ef420-50cd-4d46-8c27-cfd009d232ac","updated_at":"2026-05-07T13:30:44.259Z","updated_by":"elastic","created_at":"2026-05-07T13:30:44.259Z","created_by":"elastic","name":"Kerberoasting RC4 Service Ticket Request","tags":["MITRE: T1558.003"],"interval":"5m","enabled":true,"revision":0,"description":"Detects potential Kerberoasting activity by identifying Kerberos service ticket requests using RC4-HMAC encryption (0x17). Modern Kerberos environments should prefer AES encryption; RC4 requests may indicate credential access attempts against SPN-enabled service accounts.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.10.100:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"20340929-3561-44e3-b311-81d910d9d1c0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"4769\" AND winlog.event_data.TicketEncryptionType: \"0x17\"\n","filters":[],"actions":[]}
{"exported_count":6,"exported_rules_count":6,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
